# AddReferencePoint Method (XYZ, DirectShapeReferenceOptions) (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
DirectShapeType..::..AddReferencePoint Method (XYZ, DirectShapeReferenceOptions)
DirectShapeType Class See Also
---
Adds a reference point to the DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void AddReferencePoint(
	XYZ refPoint,
	DirectShapeReferenceOptions options
)
```

Visual Basic
---
```text
Public Sub AddReferencePoint ( _
	refPoint As XYZ, _
	options As DirectShapeReferenceOptions _
)
```

Visual C++
---
```text
public:
void AddReferencePoint(
	XYZ^ refPoint,
	DirectShapeReferenceOptions^ options
)
```

# ### Parameters
refPoint
    Type: Autodesk.Revit.DB..::..XYZ The coordinates of the new reference point.
options
    Type: Autodesk.Revit.DB..::..DirectShapeReferenceOptions The options that are used to configure the new reference point.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input point lies outside of Revit design limits. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeType Class
AddReferencePoint Overload
Autodesk.Revit.DB Namespace